Revit 2024 API
UIControlledApplication.FabricationPartBrowserChanged Event
 Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public event EventHandler<FabricationPartBrowserChangedEventArgs> FabricationPartBrowserChanged
Visual Basic
Public Event FabricationPartBrowserChanged As EventHandler(Of FabricationPartBrowserChangedEventArgs)
Visual C++
public:
 event EventHandler<FabricationPartBrowserChangedEventArgs^>^ FabricationPartBrowserChanged {
	void add (EventHandler<FabricationPartBrowserChangedEventArgs^>^ value);
	void remove (EventHandler<FabricationPartBrowserChangedEventArgs^>^ value);
}
Remarks
More docs about the different conditions goes here
See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace